# **Контрольная работа**

## **Задание**

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Решение
* Разрабатывается алгоритм решения задачи;
* Создается блок-схема для данного алгоритма;
* Алгоритм реализуется в коде на C#.

## Реализация алгоритма в коде
 1. Задаётся строковый массив на старте:

 string[] initialArray = {"dfghg", "er?", "34", "df#56", ",", "end", "vcbgf", "456", "<>(", "цы"};

 2.  Первым методом определяется сколько строк имеет меньше или равное трём количество символов:

 int numberOfStrings(string[] firstArray)
 {
     int result = 0;
     for (int i = 0; i < firstArray.Length; i++)
     {    
         if (firstArray[i].Length <= 3)
         result ++;
     }
     return result;
 }

 3. Вторым методом формирует массив из строк, длина которых меньше либо равна 3 символам:

 string[] stringsArray(string[] secondArray, int dimension)
 {
     string[] outputArray = new string[dimension];
     dimension = 0;
     for (int i = 0; i < secondArray.Length; i++)
     {
     if (secondArray[i].Length <= 3)
         {
         outputArray[dimension] = secondArray[i];
         dimension ++;
         }
     }
      return outputArray;
 } 

 4. Следующим этапом определяется сколько строк в массиве с колчеством символов меньше четырех, с помощью первого метода:

 int number = numberOfStrings(initialArray);

 5. Далее заполняется вновь созданный массив строками изначально созданого, в которых количество символов менее или равно 3

 string [] resultArray = stringsArray(initialArray, number);

 6. Конечным этапом является вывод результируещего массива в консоль:

 Console.WriteLine($"Результат: [ {String.Join("; ", resultArray)} ]");